package Data
{
   import IsoEngine.MathFunctions;
   import com.gskinner.utils.Rndm;
   
   public class NamePhonetics
   {
      
      public static var vowels:*;
      
      public static var EnglishSyllables:* = {
         "sie":0.0022217564451896873,
         "nald":0.002431356109830224,
         "o":0.007503667994131208,
         "is":0.003437434500104799,
         "cil":0.0019283169146929362,
         "kim":0.0018025571159086143,
         "glen":0.0018444770488367217,
         "jo":0.009641584573464682,
         "chard":0.0018025571159086143,
         "org":0.0016767973171242926,
         "lis":0.0030601551037518337,
         "u":0.0023475162439740094,
         "mer":0.0028924753720394043,
         "gi":0.0025990358415426532,
         "di":0.006413749738000418,
         "han":0.0025151959756864383,
         "ckie":0.001760637182980507,
         "y":0.0034793544330329064,
         "mon":0.002431356109830224,
         "da":0.014755816390693774,
         "stein":0.002054076713477258,
         "well":0.0034793544330329064,
         "ma":0.013875497799203518,
         "jes":0.0016767973171242926,
         "ken":0.0025990358415426532,
         "ra":0.008551666317333891,
         "ben":0.003940473695242087,
         "ton":0.011444141689373294,
         "ley":0.014127017396772164,
         "xan":0.0022217564451896873,
         "lou":0.001634877384196185,
         "der":0.005575351079438272,
         "mar":0.011108782225948436,
         "cy":0.003982393628170194,
         "tom":0.0018025571159086143,
         "ci":0.002850555439111297,
         "vey":0.0023055963110459017,
         "wil":0.005114231817229091,
         "dith":0.0026828757073988677,
         "dra":0.0018863969817648288,
         "les":0.004904632152588555,
         "sa":0.008383986585621462,
         "nard":0.0020959966464053656,
         "van":0.0016767973171242926,
         "vi":0.004820792286732341,
         "kins":0.003102075036679941,
         "har":0.008342066652693355,
         "bran":0.001634877384196185,
         "ker":0.00326975476839237,
         "lyn":0.00326975476839237,
         "deb":0.0017187172500523996,
         "lip":0.001634877384196185,
         "law":0.0019283169146929362,
         "ge":0.005743030811150701,
         "ri":0.018067491092014252,
         "thy":0.004108153426954516,
         "son":0.02402012156780549,
         "ho":0.002766715573255082,
         "step":0.0025151959756864383,
         "al":0.007503667994131208,
         "non":0.0025571159086145456,
         "am":0.0026828757073988677,
         "sen":0.0025990358415426532,
         "col":0.003227834835464263,
         "ha":0.0038566338293858724,
         "cas":0.002012156780549151,
         "ju":0.0056591909452944865,
         "renc":0.003521274365961014,
         "bert":0.004485432823307481,
         "le":0.009473904841752251,
         "li":0.01215678054915112,
         "nis":0.0026828757073988677,
         "san":0.0036470341647453354,
         "sher":0.0028086355061831894,
         "dan":0.003143994969608048,
         "gar":0.0037308740306015507,
         "pen":0.0019283169146929362,
         "lo":0.004024313561098302,
         "do":0.005575351079438272,
         "the":0.003353594634248585,
         "lie":0.004904632152588555,
         "ny":0.0071683085307063495,
         "dal":0.0016767973171242926,
         "kath":0.0019283169146929362,
         "cho":0.001634877384196185,
         "pau":0.0016767973171242926,
         "sta":0.002431356109830224,
         "leen":0.0029763152378956188,
         "ron":0.004820792286732341,
         "ta":0.006623349402640954,
         "za":0.0019283169146929362,
         "ham":0.0016767973171242926,
         "ryl":0.0016767973171242926,
         "pat":0.005114231817229091,
         "brad":0.0028086355061831894,
         "ber":0.006162230140431774,
         "gil":0.0019283169146929362,
         "ba":0.0018444770488367217,
         "gan":0.0019283169146929362,
         "chen":0.0016767973171242926,
         "bar":0.00544959128065395,
         "nett":0.0041500733598826235,
         "frey":0.002012156780549151,
         "de":0.0041500733598826235,
         "ward":0.003102075036679941,
         "mil":0.0026828757073988677,
         "kin":0.002012156780549151,
         "dy":0.008048627122196604,
         "by":0.003227834835464263,
         "rie":0.005072311884300984,
         "mas":0.0018863969817648288,
         "bet":0.0019283169146929362,
         "kel":0.0023475162439740094,
         "than":0.0019283169146929362,
         "chris":0.00591071054286313,
         "rin":0.0038985537623139797,
         "win":0.0026409557744707605,
         "gen":0.003018235170823726,
         "mel":0.0018025571159086143,
         "na":0.015552295116327813,
         "on":0.00217983651226158,
         "dall":0.0019283169146929362,
         "don":0.005114231817229091,
         "ran":0.0038985537623139797,
         "tes":0.0019702368476210434,
         "wood":0.0020959966464053656,
         "nan":0.002473276042758331,
         "car":0.007042548731922028,
         "ar":0.004191993292810731,
         "ro":0.013498218402850554,
         "ty":0.0036470341647453354,
         "mor":0.0022217564451896873,
         "mo":0.002850555439111297,
         "er":0.0025990358415426532,
         "rick":0.005030391951372877,
         "me":0.006329909872144203,
         "her":0.004736952420876126,
         "jim":0.002054076713477258,
         "mes":0.0023894361769021166,
         "ka":0.006287989939216096,
         "lan":0.0037727939635296575,
         "ray":0.0028086355061831894,
         "chell":0.0018863969817648288,
         "lin":0.006916788933137705,
         "pe":0.0029763152378956188,
         "cey":0.0019283169146929362,
         "my":0.004736952420876126,
         "nor":0.005407671347725843,
         "co":0.0028086355061831894,
         "sy":0.0023055963110459017,
         "gton":0.0018444770488367217,
         "bow":0.002263676378117795,
         "roy":0.001634877384196185,
         "hen":0.004569272689163697,
         "rod":0.0019702368476210434,
         "kris":0.003018235170823726,
         "cha":0.0025151959756864383,
         "ler":0.004066233494026409,
         "ve":0.0025571159086145456,
         "john":0.0028924753720394043,
         "be":0.0018863969817648288,
         "hol":0.003018235170823726,
         "ston":0.002054076713477258,
         "cher":0.0023894361769021166,
         "ca":0.011066862293020329,
         "den":0.0030601551037518337,
         "char":0.003227834835464263,
         "ja":0.008928945713686857,
         "cky":0.0018863969817648288,
         "rey":0.001760637182980507,
         "ren":0.004024313561098302,
         "vin":0.008174386920980926,
         "sha":0.002137916579333473,
         "man":0.01027038356738629,
         "jen":0.0030601551037518337,
         "la":0.006874869000209598,
         "mi":0.004569272689163697,
         "cal":0.002012156780549151,
         "tho":0.0025571159086145456,
         "ry":0.0166422133724586,
         "ed":0.005575351079438272,
         "con":0.005072311884300984,
         "fran":0.004233913225738838,
         "lynn":0.0020959966464053656,
         "wal":0.0038566338293858724,
         "su":0.0018444770488367217,
         "tha":0.002263676378117795,
         "las":0.0025990358415426532,
         "bo":0.0028924753720394043,
         "per":0.0018863969817648288,
         "ly":0.01027038356738629,
         "ann":0.004820792286732341,
         "lard":0.0016767973171242926,
         "land":0.002850555439111297,
         "re":0.006832949067281492,
         "bur":0.002431356109830224,
         "ney":0.004191993292810731,
         "len":0.007042548731922028,
         "ric":0.001760637182980507,
         "niel":0.0018025571159086143,
         "cis":0.002054076713477258,
         "tin":0.005072311884300984,
         "lu":0.0030601551037518337,
         "si":0.002431356109830224,
         "lau":0.003227834835464263,
         "ni":0.011318381890588973,
         "stan":0.001634877384196185,
         "a":0.025654998952001674,
         "an":0.020163487738419614,
         "fer":0.0026409557744707605,
         "tra":0.002012156780549151,
         "ter":0.011276461957660867,
         "ters":0.002054076713477258,
         "beth":0.0025151959756864383,
         "ford":0.0030601551037518337,
         "e":0.01542653531754349,
         "ti":0.005407671347725843,
         "neal":0.0016767973171242926,
         "to":0.003227834835464263,
         "ner":0.005030391951372877,
         "ven":0.0025571159086145456,
         "ste":0.002012156780549151,
         "i":0.0023894361769021166,
         "ris":0.0017187172500523996,
         "nes":0.0025990358415426532,
         "el":0.005533431146510164,
         "cur":0.0025990358415426532,
         "nie":0.00591071054286313,
         "va":0.0029343953049675115,
         "ver":0.004275833158666946
      };
      
      public static var EnglishNeutralNames:* = ["Smith","Williams","Grey","Wild","Schmidt","Seller","Cadillac","Citroen","Coke","Kinder","Pepsi","Burger","Rockatansky","Gonzales","Rodriguez","Martin","Akbar","Linden","Ice","Fox","Rubik","McFly","Maradonna","Swatch","Boney","Goks","Magritte","DeLorean","Pet Shop","Gooney","Smurf","DMC","Walmart","Pringles","Heinz","McDonalds","Juicyfruit","Jackson","MTV","Pacman","Disco","McDuck","Simpson","ThunderCat","Dragonball","Gadget","Ghostbuster","Pooh","Fraggle","Wayne","O\'Hara","Poppins","Colgate","Kelloggs","Ironbar","Vaultdweller","Cassidy","Dogmeat","Modoc","Stark","Lannister","Targaryen","Baratheon","Robber","Goks","Masriah","Smerd","Kulin","Quabba","De Quabba","Qubba","De Qubba","Tifk","Ozbet","Orth","Mundschau","Ausz","Botxo","Serino","Araten","Lintu","Kivi","Pullid","Janubi","Shinobi","Alkubra","Winchester","Grune","Boryokudan","Cosca","Bydlo","Rover","Mimb","Northway","Nirgendwo","Diep Gat","Verdammter","Kirdyk","Sekir","Bashka","Merdin","Okaidi"
      ,"Drushlak","Caganel","Poca","Cosa","Burgerking","Skywalker","Solo","Kirk","McCoy","MacCoy","Raff","Sheppard","Al Habash","Montoya","Baranauskas","Vaculik","Bakker","Sorescu","Cordoba","Kralik","Whirlwindhorse","Hulan","Peeterson","Schneider","Cohen","Salenko","Hoffmann","Abarba","Xun","Jacobsen","Ta\'anari","Ogego","Fournier","Perdue","Kivikas","Bergmann","Jestespanski","Al-Karachi","Brooks","Naruszewicz","Bernard","Gimenez","Nakamura","Manzoni","Tahiri","Lazarevic","Ferrero","MacLean","Nhat Co","Vieira","Gobetti","Muller","Ali\'ikai","Larsson","McNeill","Mason","Simberg","Llompart","Wilson","Harris","O\'Bryen","Araya","Menasse","Berg","Zenawi","Maiorescu","Rubanov","Milloshi","Nilsson","Ashrawi","Mahankali","Bombata","Mitchell","Park","Kobayashi","Ulloa","Pell","Seton","Maldini","Kaminski","Schnittke","Lee","Piglet","Mapache","Flea","Fly","Bug","Dragonfly","Smiley","FSM","Gummibear","Holder","Peugeot","Ferrari","Chevrolet","Pontiac","Ford","Sony","Sanyo","Grundig","Telefunken","Samsung"
      ,"Panasonic","Ghibli","Miyazaki","Ericsson","Iphone","Ipod","Asus","Macintosh","Philips","Carlsberg","Intel","Rollsroyce","Lego","Canon","Nikon","Harleydavidson","Microsoft","Linux","Unix","Nike","Adidas","Puma","Reebok","BMW","Firefox","Chrome","Google","Adobe","Fedex","KFC","Amex","Hilton","Shell","IBM","Warner","Disney","Audi","Lacoste","Dior","Gucci","Marlboro","Xbox","Yahoo","Rolex","Saab","Absolute","Smirnoff","Tüborg","Pizzahut","Disneyland","Starbucks","Heineken","Guinness","Budweiser","Fosters","Damm","Sanmiguel","Martini","Duff","Winston","Chesterfield","Pallmall","Luckystrike","Camel","Steadtler","Chivaldori","Gilette","Bic","Pilot","Fabercastell","R2-D2","C-3PO","Special K","Doofenshmirtz","Kent","Z Bazin","Makhno","Shus","Broflovski","Cartman","McKormick","Marsh","Fry","Archer","Tunt","Poovey","Figgis","Kane","Gilette","Krieger"];
      
      public static var EnglishMaleNames:* = ["John","Peter","Adam","William","Steven","Jack","Eric","Arnold","Oleg","Kuznetz","Ahmed","Mohammed","Bob","Becker","Bowie","Kasparov","Hulk","Marty","Bon Jovi","Prince","Indiana","Spielberg","E.T.","Alf","Dali","Garfield","Snoopy","Misha","Kermit","Elmo","Big Bird","Snuffleupagus","Oscar","Bert","Ernie","Fozzie","Kalashnikov","Mario","Sonic","Kodak","Tron","Hannibal","B.A.","Leonardo","Raphael","Michelangelo","Donatello","Splinter","Shredder","Scooby","Shaggy","Alvin","Chip","Dale","Beetlejuice","He-Man","Homer","Bart","Bender","Max","Toecutter","Goose","The Boy","Fifi","Pappagallo","Toadie","Wez","Humungus","Kid","Jedediah","Jeremiah","Harold","Harry","Master","Hakunin","Myron","Sulik","Vic","Luke","Han","Spock","Yevseev","Mariachi","Kurdi","Markus","Chen","Totoro","Mojo","Jojo","Fuzzy","Lumpkins","Morbucks","Ace","Snake","Lil\'","Grubber","Bossman","Junior","Slim","Brickl","Boomer","Butch","Utonium","Mayor","Spike","BigMacintosh","Ashitaka","Kenji"
      ,"Otcho","Tomodachi","Fukubei","Yoshitsune","Kenzo","Tenma","Dieter","Porcorosso","Howl","Trollface","Oliver","Benji","Fiat","Volkswagen","Volvo","Kamaz","Dodge","Rambo","Rocky","Jagger","Stallone","Schwartznegger","Chucknorris","Brucelee","Playboy","Gagarin","Chewbacca","Darth Vader","Yoda","Torpedo","Crowbar","Machette","Phineas","Ferb","Batman","Spiderman","Thor","Jonathan","Clark","Jožin","Hurley","Nike","Gargamel","Bakhunin","Kropotkin","Garrus","Vakarian","Bender","Sterling","Cyril","Ray"];
      
      public static var EnglishFemaleNames:* = ["Ava","Natalia","Pocahontas","Sarah","Chihiro","Ponyo","Marilyn","Turner","Madonna","Vanilla","Bubbles","Blossom","Buttercup","Kalinka","Gala","Barbie","Piggy","Smurfette","April","Tina","Fanta","Mirinda","Cola","Sega","Daphne","Velma","Zelda","Rexona","Sirenita","Snow White","Cinderella","Aurora","Ariel","Belle","Jasmine","Mulan","Rapunzel","Gretyl","Xena","Marge","Lisa","Maggie","Dorothy","Catwoman","Wonderwoman","Cruella","Sheena","Aunty","Entity","Billy Jean","Lara","Wilma","Jessie","Tandi","Kidda","Quilla","Katja","Daenerys","Arya","Sansa","Leela","Coca","Princess","Leia","Yevseyeva","Erin","Natilla","Marisol","Heidi","Bellum","Keane","Twilightsparkle","Applejack","Rainbowdash","Pinkiepie","Fluttershy","Dagmar","Huira","Rarity","Celestia","Applebloom","Scootaloo","Sweetiebelle","Zecora","Derpyhooves","Björk","Gaia","San","Eboshi","Mononoke","Kanna","Yukiji","Nina","Nausicaä","Laputa","Kanta","Mei","Kiki","Ursula","Sofi","Gominola","Toyota","Yamaha"
      ,"Honda","Aprilla","Mercedes","Mazda","Nokia","Opera","Coronita","Deidranna","Bonbon","Candace","Lois","Martha","Kappa","Sheila","Turanga","Saga","Cheryl","Pam","Lana","Malory"];
      
      public static var RussianSyllables:* = {
         "ад":0.0020955835634162406,
         "гвла":0.0015017963795154977,
         "гей":0.0019546457493386325,
         "уп":0.0031699455887619432,
         "нис":0.0026963021152224395,
         "гу":0.0029920404791885687,
         "ли":0.009849473793653179,
         "ток":0.0018807111583471002,
         "ги":0.004177304391021569,
         "лий":0.0018784007023786148,
         "ро":0.011374374732853531,
         "деж":0.001279992606540901,
         "вич":0.024809676189596022,
         "дров":0.002959694095629773,
         "вик":0.004616291025033791,
         "рьев":0.0026870602913484985,
         "щи":0.0016681492092464453,
         "дрей":0.0012661298707299887,
         "меж":0.0014347931564294215,
         "пк":0.003303952034934095,
         "штаб":0.004255859893950072,
         "се":0.005568198884049768,
         "за":0.007746958862331483,
         "да":0.00563751256310433,
         "льев":0.004357519956563429,
         "ла":0.014287859709113596,
         "наль":0.001619629633908252,
         "са":0.004523872786294377,
         "ти":0.0095144576782228,
         "чес":0.0020054757806453106,
         "во":0.0021672076984392873,
         "мор":0.0051500063537539146,
         "ци":0.0068805378741494646,
         "мо":0.004098748888093066,
         "ной":0.002534570197428463,
         "ан":0.005914767279322575,
         "не":0.0027240275868442645,
         "аль":0.001825260215103451,
         "ров":0.008957637789817823,
         "хай":0.0032808474752492414,
         "пет":0.003012834582904937,
         "те":0.005133833161974516,
         "лив":0.001589593706317942,
         "ка":0.010036620727100496,
         "ло":0.007204001709737419,
         "даль":0.004385245428185253,
         "раль":0.0017836720076707141,
         "ген":0.0016519760174670474,
         "сандр":0.0024098055751302526,
         "ные":0.0014902440996730707,
         "ле":0.01570647967376362,
         "си":0.00869886672134746,
         "вч":0.004526183242262862,
         "свет":0.0018529856867252755,
         "ком":0.005625960283261903,
         "бо":0.003195360604415282,
         "и":0.02014486558922404,
         "со":0.0035696544713099136,
         "рье":0.0018298811270404218,
         "фло":0.004304379469288265,
         "центр":0.002273488672989615,
         "вос":0.004322863117036148,
         "ков":0.004542356434042259,
         "люд":0.002352044175918118,
         "до":0.004225823966359761,
         "твен":0.0014648290840197317,
         "увд":0.003789147788316025,
         "кра":0.004625532848907733,
         "ми":0.015925972990769734,
         "э":0.0022457632013677905,
         "е":0.024116539399050407,
         "вла":0.008562549819206821,
         "нов":0.009867957441401063,
         "ход":0.002439841502720562,
         "ди":0.01294086387948662,
         "дмит":0.001799845199450112,
         "у":0.0024513937825629893,
         "вод":0.0019222993657798371,
         "хо":0.003199981516352253,
         "сер":0.004704088351836236,
         "ска":0.003130667837297691,
         "га":0.007039959335974956,
         "при":0.00542726106997216,
         "ри":0.011235747374744408,
         "рий":0.002682439379411528,
         "по":0.005156937721659371,
         "го":0.008869840463015378,
         "пав":0.001885332070284071,
         "лья":0.003024386862747364,
         "ге":0.00606263646130564,
         "ни":0.023222392939246564,
         "фе":0.005575130251955225,
         "лен":0.004119542991809434,
         "ма":0.008400817901412845,
         "ав":0.0012591985028245327,
         "но":0.01533680671880596,
         "мрк":0.0014232408765869947,
         "на":0.08801913057541909,
         "гри":0.0023497337199496326,
         "му":0.002017028060487738,
         "сов":0.0015803518824440007,
         "лев":0.0013608585654378896,
         "рос":0.002897311784480668,
         "зи":0.002442151958689048,
         "ве":0.002559985213081802,
         "ницы":0.00151565911532641,
         "мур":0.001672770121183416,
         "лов":0.004789575222670195,
         "та":0.016383443272529837,
         "гос":0.0017166687845846383,
         "ско":0.003273916107343785,
         "сий":0.0016288714577821937,
         "тра":0.002056305811951989,
         "ви":0.003463373496759586,
         "лю":0.0015133486593579247,
         "про":0.0024213578549726793,
         "ский":0.004951307140464172,
         "ко":0.029460624054157093,
         "дро":0.0019985444127398545,
         "ва":0.04878758823053731,
         "зо":0.001462518628051246,
         "тья":0.003114494645518294,
         "оль":0.0022388318334623345,
         "жи":0.0019199889098113516,
         "ра":0.010256114044106607,
         "ев":0.013749523468456504,
         "рав":0.003327056594618949,
         "ской":0.0013747213012488017,
         "о":0.05639360927879118,
         "ю":0.007340318611878056,
         "че":0.0014694499959567024,
         "тор":0.0022827304968635566,
         "де":0.0063722375610826805,
         "лье":0.0028025830897727673,
         "ин":0.0022596259371787026,
         "я":0.022492288853205186,
         "ал":0.0014278617885239656,
         "связь":0.001522590483231866,
         "ме":0.003130667837297691,
         "лек":0.011774083615401503,
         "а":0.0305188128877234,
         "па":0.00478726476670171,
         "су":0.0012684403266984743,
         "ба":0.0027794785300879134,
         "чен":0.0027679262502454866,
         "ки":0.00430206901331978,
         "сан":0.005533542044522487,
         "бе":0.001728221064427065,
         "ха":0.0020355117082356206,
         "кон":0.0014833127317676147,
         "фи":0.002698612571190925,
         "рен":0.0017975347434816265,
         "хк":0.0016681492092464453,
         "ре":0.004443006827397388,
         "то":0.011970472372722758,
         "мир":0.0022157272737774805,
         "ку":0.0020054757806453106
      };
      
      public static var RussianNeutralNames:* = ["Серых","Уайлд","Шмидт","Селлер","Кадилак","Ситроен","Ситро","Киндер","Пепси","Бургер","Гонзалес","Родригес","Мартин","Акбар","Линден","Айс","Фокс","Рубик","Мак Флай","Марадонна","Свотч","Бони","Гокс","Магрит","Де Лореан","Пет Шоп","Гуни","Волмарт","Принглс","Хаинц","Макдональдс","Джусифрут","Джексон","МТВ","Пакман","Диско","Мак Дак","Симпсон","Драгонбол","Гаджет","Пух","Фрегл","Вейн","О\'Хара","Поппинс","Колгейт","Келлоггс","Прут","Волтдвеллер","Касиди","Догмит","Модок","Старк","Ланистер","Таргериен","Баратеон","Робер","Гокс","Масриах","Смерд","Кулин","Куабба","Де Куабба","Ниргендво","Диеп Гат","Вердаммтер","Кирдык","Секир","Башка","Мердин","Окаиди","Друшлак","Каганель","Пока","Коса","Бургеркинг","Скайуокер","Соло","Кёрк","Мак Кой","Рафф","Шеппард","Аль Хабаш","Монтойя","Баранаускас","Вакулик","Беккер","Сореску","Кордоба","Кралик","Уилдвиндхорс","Хулан","Peeterson","Шнайдер","Коэн","Саленко","Хофман","Абарба","Чун","Якобсен","Та\'анари","Огего"
      ,"Фурнье","Пердуа","Кивикас","Бергман","Аль Карачи","Брукс","Нарушевич","Бернард","Хименес","Накамура","Манзони","Тахири","Лазаревич","Ферреро","Мак Лин","Нхат Ко","Виеира","Гобетти","Мюллер","Али\'икаи","Ларсон","Мак Нил","Мейсон","Симберг","Йомпарт","Уилсон","Харрис","О\'Браен","Арайя","Менассе","Берг","Зенауи","Майореску","Миллоши","Нильсон","Ашрауи","Маханкали","Бомбата","Митчел","Парк","Кобаяши","Уйоа","Пель","Сетон","Мальдини","Шитка","Ли","Чебурашка","Ёж","З Бажен","Колобок","Пятачок","КЦ","Сони","Санио","Грюндиг","Самсунг","Панасоник","Эскимо","Кент","Махно","Щусь"];
      
      public static var RussianMaleNames:* = ["Кузнецов","Рубанов","Каминский","Рокатанский","Ястеспанский","Джон","Петр","Сидр","Максим","Семен","Джек","Эрик","Арнольд","Сильвестр","Кузнецов","Ахмед","Мухамед","Боб","Беккер","Боуи","Каспаров","Баблгам","Марти","Брюс","Принц","Индиана","Спилберг","Дали","Гарфильд","Снупи","Миша","Кермит","Эльмо","Биг Бёрд","Снаффлеупагус","Оскар","Берт","Эрни","Фози","Калашников","Марио","Соник","Кодак","Трон","Ганибал","Леонардо","Рафаэль","Микельанжело","Донателло","Сплинтер","Шредер","Скуби","Шаги","Элвин","Чип","Дейл","Битлджус","Хи-Мен","Хомер","Барт","Бендер","Макс","Токатер","Гусь","Бой","Фифи","Папагалло","Тоди","Вез","Хумунгус","Кид","Джедедия","Иеремия","Гарольд","Гарри","Мастер","Хакунин","Майрон","Сулик","Вик","Люк","Хен","Спок","Евсеев","Мариачи","Курди","Маркус","Чен","Тоторо","Гена","Ёжин","Буратино","Чиполино","Карабас","Барабас","Владимир","Машков","Гедеван","Би","Уэф","Плюканин","Четланин","Пацак","ПЖ","Эцилопп","Пепелац","Транклюкатор","Луц"
      ,"Чатл","Цак","Эцих","Косой","Ботаник","Циклоп","Лось","Кю","Жук","Клоп","Цуцик","Карабас","Мойдодыр","Айболит","Копчик","Копчёный","Рэмбо","Робокоп","Скарабей","Каюк","Крепыш","Ящер","Ящур","Змей","Пёс","Рыжий","Лысый","Каратыш","Трус","Балбес","Бывалый","Жигуль","Москвич","Запор","Камаз","ЦУМ","Кацап","Хохол","Бурлак","Беломор","Гагарин","Мосфильм","Спартак","Зенит","Торпедо","Зефир","Пормбир","Рахат Лукум","Щербет","Ирис","Джонатан","Кларк","Ёжин","Бакунин","Кропоткин"];
      
      public static var RussianFemaleNames:* = ["Кузнецова","Рубанова","Каминская","Рокатанская","Ястеспанская","Ева","Наталья","Покахонтас","Сара","Чихиро","Поньё","Мерлин","Тёрнер","Мадонно","Ванила","Баблс","Блассом","Баттеркап","Калинка","Гала","Барби","Пиги","Смурфет","Эйприл","Тина","Фанта","Миринда","Кола","Сега","Дафни","Вельма","Зельда","Рексона","Русалочка","Белоснежка","Золушка","Аврора","Ариель","Бель","Жасмин","Мулан","Рапунцель","Гретль","Ксена","Мардж","Лиза","Маги","Дороти","Круэла","Шина","Онти","Энтити","Билли Джин","Лара","Вильма","Джеси","Танди","Кидда","Куилла","Катя","Денерис","Арья","Санса","Лила","Кока","Принцеса","Лея","Евсеева","Эрин","Елизавета","Матрёна","Нива","Цаппа","Каппа","Зая","Зайка","Чушка","Вошь","Тля","Цокотуха","Тигра","Перхоть","Шевелюра","Конфетка","Гадюка","Муха","Стрекоза","Лечина","Кобра","Крыска","Жаба","Лыжа","Малява","Каратышка","Мелкая","Шустрая","Игла","Пробка","Стопка","Мушка","Крошка","Плюшка","Беха","Волга","Прима","ЦСКА","Зенитовна","Торпедовна"
      ,"Жигулевна","Запороженовна","Халва","Карамелька","Марта","Лоис"];
      
      public static var GreekSyllables:* = {
         "ύ":0.013430036263598857,
         "μή":0.0014755533324996883,
         "δεν":0.005326997624109044,
         "συ":0.0014505439539827445,
         "νο":0.008153057396523701,
         "κά":0.008778291859447299,
         "ασ":0.0023508815805927236,
         "τισ":0.0020257596598724534,
         "σα":0.0045517068900837844,
         "ό":0.010003751406777547,
         "μι":0.007352757283981498,
         "νά":0.002701012879829938,
         "την":0.008053019882455926,
         "στα":0.0024009003376266116,
         "λη":0.002500937851694387,
         "βε":0.0015255720895335763,
         "θη":0.003326247342753535,
         "τι":0.0116293610103789,
         "κό":0.005051894460422661,
         "γι":0.0071276728773290035,
         "στην":0.002926097286482433,
         "ζε":0.004501688133049897,
         "φο":0.003351256721270478,
         "χέρι":0.0015255720895335763,
         "πωσ":0.0022508440665249484,
         "άν":0.001350506439914969,
         "τησ":0.008228085532074533,
         "χι":0.0014005251969488569,
         "ένη":0.0015005627110166323,
         "τή":0.002550956608728275,
         "μά":0.005352007002625989,
         "κή":0.002726022258346882,
         "τε":0.008978366887582849,
         "κι":0.005402025759659876,
         "αν":0.003176191071651871,
         "θα":0.0033012379642365906,
         "δε":0.003901463048643244,
         "ρά":0.005151931974490437,
         "δι":0.012954858071776924,
         "κα":0.029811179192197095,
         "γω":0.0026760035013129943,
         "αλ":0.0018506940102538463,
         "νοσ":0.001675628360635239,
         "πα":0.008428160560210085,
         "με":0.020382643491309256,
         "νισ":0.0024009003376266116,
         "υσ":0.004701763161185447,
         "δα":0.0016006002250844077,
         "νω":0.002475928473177443,
         "μό":0.0029761160435163208,
         "να":0.025359509816181087,
         "θυ":0.0013254970613980253,
         "ένοσ":0.0013254970613980253,
         "ρο":0.006377391521820687,
         "φι":0.0019257221458046782,
         "πο":0.01828185569588597,
         "το":0.03928973365011882,
         "κε":0.007677879204701768,
         "στο":0.006402400900337631,
         "σι":0.0032262098286857596,
         "σω":0.0024009003376266116,
         "τά":0.006002250844066529,
         "γά":0.002125797173940229,
         "μπο":0.0014005251969488569,
         "χο":0.00232587220207578,
         "λά":0.004601725647117672,
         "δη":0.001675628360635239,
         "βι":0.001350506439914969,
         "νή":0.0019757409028385658,
         "λα":0.004151556833812683,
         "ξε":0.004726772539702392,
         "πό":0.009453545079404784,
         "μη":0.0019007127672877341,
         "ση":0.005377016381142932,
         "γε":0.0037013880205076927,
         "μα":0.01615605852194574,
         "πί":0.0022508440665249484,
         "τό":0.0037514067775415807,
         "βα":0.002100787795423285,
         "ξα":0.001350506439914969,
         "ρι":0.007002625984744284,
         "τον":0.005677128923346258,
         "θε":0.0047767912967362795,
         "δο":0.0020257596598724534,
         "λο":0.008453169938727028,
         "αρ":0.0014755533324996883,
         "προ":0.0014255345754658007,
         "φω":0.0014505439539827445,
         "ρό":0.0024509190946604992,
         "ένα":0.005852194572964866,
         "σο":0.004151556833812683,
         "γο":0.0035263223708890856,
         "λί":0.0034012754783043666,
         "στη":0.00155058146805052,
         "νό":0.0019007127672877341,
         "γωτέ":0.0018006752532199585,
         "μασ":0.0015005627110166323,
         "ένο":0.0022758534450418922,
         "χε":0.0038514442916093563,
         "ρε":0.004301613104914346,
         "υν":0.0038764536701262997,
         "ζω":0.0015255720895335763,
         "ταν":0.00697761660622734,
         "πε":0.006177316493685136,
         "πά":0.003676378641990749,
         "γα":0.002901087907965489,
         "σε":0.018782043266224846,
         "τασ":0.0033762660997874224,
         "λι":0.005151931974490437,
         "ισ":0.002876078529448545,
         "ρα":0.009278479429786176,
         "νε":0.007852944854320375,
         "ρη":0.0013254970613980253,
         "τη":0.008428160560210085,
         "ρω":0.0018506940102538463,
         "βά":0.0021758159309741166,
         "χα":0.004026509941227963,
         "πι":0.0030261348005502084,
         "σαν":0.0032262098286857596,
         "α":0.058096786294860606,
         "λό":0.003676378641990749,
         "κο":0.008253094910591476,
         "ι":0.06469926222333379,
         "μο":0.011554332874828066,
         "των":0.002150806552457173,
         "πρώ":0.002500937851694387,
         "ε":0.02608478179317246,
         "χνησ":0.001950731524321622,
         "μοσ":0.0017006377391521833,
         "τυ":0.0013254970613980253,
         "υ":0.05084406652494689,
         "η":0.009253470051269233,
         "γή":0.002500937851694387,
         "τα":0.026509941227960503,
         "λε":0.005777166437414033,
         "ά":0.00840315118169314,
         "άλ":0.0017256471176691271,
         "τί":0.00342628485682131,
         "νη":0.0035263223708890856,
         "ρί":0.0044266599974990654,
         "νί":0.0013755158184319129,
         "λύ":0.001575590846567464,
         "ί":0.029185944729273498,
         "μί":0.001575590846567464,
         "ή":0.007577841690633993,
         "ω":0.002876078529448545,
         "νι":0.005352007002625989,
         "σί":0.0019257221458046782,
         "ο":0.022233337501563102,
         "ώ":0.00232587220207578,
         "ασ":0.00155058146805052
      };
      
      public static var GreekNeutralNames:* = ["Σμίθ","Ουίλιαμς","Γκρίζος","Άγριος","Σμίντ","Σέλλερ","Κάντιλακ","Σιτροέν","Κόκα","Κίντερ","Πέπσι","Μπέργκερ","Ροκατάνσκι","Γκονζάλες","Ροντρίγκεζ","Μάρτιν","Άκμπαρ","Λίντεν","Άις","Αλεπού","Ρούμπικ","Μακ Φλάι","Μαραντόνα","Σουότς","Μπόνεϊ","Γκόκς","Μαγκρίτ","ΝτεΛορεάν","Πετ Σοπ","Γκούνι","Στρουμφάκι","DMC","Γουόλμαρτ","Πρίνγκλς","Χάινζ","ΜακΝτόναλντς","Χυμώδης","Τζάκσον","MTV","Πάκμαν","Ντίσκο","Μακντακ","Σίμπσον","Θάντερκατ","Ντράγκονμπολ","Σαϊνης","Γκόστμπαστερ","Πουχ","Φράγκλ","Γουέιν","Ο\'Χάρα","Πόπινς","Κολγκέιτ","Κέλλογκς","Άιρονμπαρ","Βολτβέλλερ","Κάσιντυ","Ντόγκμιτ","Μόντοκ","Στάρκ","Λάνιστερ","Ταργκάριεν","Μπαραθέον","Ρόμπερ","Γκόκς","Μασριά","Σμέρντ","Κούλιν","Κουαμπά","Ντε Κουαμπά","Νιργκεντβό","Ντιεπ Γκατ","Βερντάμτερ","Κίρντικ","Σεκίρ","Μπάσκα","Μερντίν","Οκάιντι","Ντρούσλακ","Σαγκανέλ","Πόκα","Κόζα","Μπέργκερκινγκ","Ουρανοπερπατητής","Σόλο","Κίρκ","ΜακΚόι","Ράφ","Σέπαρντ","Αλ Χαμπάς","Μοντόγια","Μπαρανάουσκας","Βακουλίκ","Μπέικερ","Σορέσκου"
      ,"Κόρντομπα","Κράλικ","Αλογοστρόβιλος","Χουλάν","Πίτερσον","Σνάιντερ","Κόεν","Σαλένκο","Χόφμαν","Αμπάρμπα","Τζούν","Γιάκομπσεν","Τα\'Ανάρι","Ογκέγκο","Φουρνιέ","Περντό","Κίβικας","Μπέρκγμαν","Γιεστεσπάνσκι","Αλ-Καράτσι","Μπρούκς","Ναρούσεβιτς","Μπερνάρντ","Χιμένεζ","Νακαμούρα","Μανζόνι","Ταχίρι","Λαζάρεβιτς","Φερέρο","Μακλίν","Νατ Κο","Βιεϊρά","Γκομπέτι","Μίλλερ","Αλί Ικάι","Λάρσον","ΜακΝιλ","Μέισον","Σίμπεργκ","Λόμπαρτ","Ουίλσον","Χάρις","Ο\'Μπρίαν","Αράγια","Μενάς","Μπέργκ","Ζεναουί","Μαϊορέσκου","Ρουμπάνοφ","Μιλόσι","Νίλσον","Ασραουί","Μαχανκάλι","Μπομπάτα","Μίτσελ","Πάρκ","Κομπαγιάσι","Ουλοά","Πέλλ","Σετόν","Μαλντίνι","Καμίνσκι","Σνίτκε","Λι","Κεντ"];
      
      public static var GreekMaleNames:* = ["Τζόν","Πίτερ","Άνταμ","Ουίλιαμ","Στίβεν","Τζάκ","Έρικ","Άρνολντ","Όλεγκ","Κούζνετς","Άχμεντ","Μοχάμεντ","Μπόμπ","Μπέκερ","Μπόουι","Κασπάροφ","Χούλκ","Μάρτυ","Μπόν Τζόβι","Πρίνς","Ιντιάνα","Σπίλμπεργκ","ΕΤ","¨Αλφ","Ντάλι","Γκάρφιλντ","Σνούπι","Μίσα","Κέρμιτ","Έλμο","Μπίγκ Μπέρντ","Σναφλοπάγους","Όσκαρ","Μπέρτ","Έρνι","Φότζι","Καλάσνικοφ","Μάριο","Σόνικ","Κόντακ","Τρόν","Χάνιμπαλ","Μπι Εϊ","Λεονάρντο","Ράφαελ","Μικελάντζελο","Ντονατέλο","Σπλίντερ","Σρέντερ","Σκούμπι","Σάγκι","Άλβιν","Τσίπ","Ντέιλ","Μπίτλτζους","Χι-Μαν","Χόμερ","Μπάρτ","Μπέντερ","Μάξ","Τόουκατερ","Γκούζ","Το αγόρι","Φίφι","Παπαγάλο","Τόντι","Βέζ","Χάμουνγκουζ","Κίντ","Γεντεντιά","Τζερεμάϊα","Χάρολντ","Χάρυ","Μάστερ","Χακούνιν","Μάιρον","Σούλικ","Βικ","Λούκ","Χαν","Σπόκ","Γέβσιβ","Μαριάτσι","Κούρντι","Μάρκους","Τσέν","Γιώργος","Πέτρος","Δημήτρης","Γιάννης","Νίκος","Χρήστος","Παπαδόπουλος","Παππάς","Θηρίο","Βλάχος","Χωριάτης","Καραγκούνης","Μανωλάς","Σουγιάς","Διαμαντής","Ζάχος","Τζόναθαν"
      ,"Ιωαναθάν","Ιωναθάν","Κλαρκ"];
      
      public static var GreekFemaleNames:* = ["Άβα","Ναταλία","Ποκαχόντας","Σάρα","Τσιχίρο","Πόνιο","Μέριλυν","Τέρνερ","Μαντόνα","Βανίλλια","Φούσκα","Άνθος","Μπάτερκαπ","Καλίνκα","Γκαλά","Μπάρμπι","Πίγκυ","Σμαρφέτ","Έιπριλ","Τίνα","Φάντα","Μιρίντα","Κόλα","Σέγκα","Δάφνη","Βέλμα","Ζέλντα","Ρεξόνα","Σιρενίτα","Χιονάτη","Σταχτοπούτα","Αυγή","Αριέλ","Μπέλλα","Γιασμίν","Μουλάν","Ραπουνζέλ","Γκρέτιλ","Τζένα","Μάρτζι","Λίζα","Μάγγυ","Ντόροθυ","Κάτγουμαν","Γουόντεργουμαν","Κρουέλλα","Σίνα","Άντι","Έντιτυ","Μπίλλυ Τζιν","Λάρα","Βίλμα","Τζέσι","Τάντυ","Κίντα","Κουίγια","Κάτια","Δανερυς","Άρια","Σάνσα","Λίλα","Κόκα","Βασιλισσα","Λία","Γιεβσεγιέβα","Έριν","Μαρία","Κάθριν","Σοφία","Αγάπη","Μιράντα","Ελπίδα","Τζούλια","Χαρά","Ξανθιά","Παπαδόπουλου","Παππά","Θηρίο","Βλάχου","Χωριάτη","Καραγκούνη","Μανωλά","Σουγιά","Διαμαντή","Ζάχου","Μάρθα","Λόης"];
      
      public static var EnglishVowels:* = ["a","e","i","o","u"];
      
      public static var RussianVowels:* = ["а","е","ё","и","о","у","э","ю","я"];
      
      public static var GreekVowels:* = ["α","ι","υ","ε","ο","η","ω","ά","ϋ","ϊ","ί","ή","ό","ύ","ώ"];
      
      public function NamePhonetics()
      {
         super();
      }
      
      public static function randomName(param1:* = 0) : *
      {
         var _loc7_:* = undefined;
         var _loc10_:* = undefined;
         var _loc11_:* = undefined;
         var _loc3_:* = undefined;
         var _loc6_:* = undefined;
         var _loc17_:* = undefined;
         var _loc12_:* = undefined;
         var _loc4_:* = undefined;
         var _loc19_:* = undefined;
         var _loc15_:* = undefined;
         var _loc16_:* = undefined;
         var _loc8_:* = undefined;
         var _loc13_:* = undefined;
         var _loc14_:* = undefined;
         var _loc20_:* = undefined;
         var _loc18_:* = undefined;
         var _loc9_:String = "";
         if(Texts.language == 14)
         {
            _loc8_ = "Russian";
            _loc14_ = RussianSyllables;
            _loc17_ = {
               "а":0.8,
               "я":0.2
            };
            _loc4_ = RussianNeutralNames;
            _loc19_ = RussianFemaleNames;
            _loc15_ = RussianMaleNames;
            vowels = RussianVowels;
         }
         else if(Texts.language == 21)
         {
            _loc8_ = "Greek";
            _loc14_ = GreekSyllables;
            _loc17_ = {
               "η":0.94,
               "α":0.01,
               "ι":0.01,
               "υ":0.01,
               "ε":0.01,
               "ο":0.01,
               "ω":0.01
            };
            _loc12_ = {
               "ος":0.5,
               "ης":0.2,
               "ας":0.2,
               "":0.1
            };
            _loc4_ = GreekNeutralNames;
            _loc19_ = GreekFemaleNames;
            _loc15_ = GreekMaleNames;
            vowels = GreekVowels;
         }
         else
         {
            _loc8_ = "English";
            _loc14_ = EnglishSyllables;
            _loc17_ = {
               "a":0.5,
               "ah":0.18,
               "ene":0.1,
               "ette":0.01,
               "etta":0.01,
               "":0.2
            };
            _loc4_ = EnglishNeutralNames;
            _loc19_ = EnglishFemaleNames;
            _loc15_ = EnglishMaleNames;
            vowels = EnglishVowels;
         }
         var _loc2_:* = MathFunctions.probabilityRandom([0,0.6,0.3,0.1]);
         var _loc5_:Array = [];
         var _loc21_:* = 0;
         while(_loc9_.length < 2)
         {
            var _temp_4:* = Number(_loc21_) + 1;
            _loc21_++;
            if(_temp_4 > 100)
            {
               break;
            }
            _loc6_ = 0;
            while(_loc6_ < _loc2_)
            {
               if(Rndm.random() > 1 / (Math.pow(_loc2_,0.3333333333333333) + 0.2))
               {
                  if(Rndm.random() > 0.5)
                  {
                     _loc16_ = _loc4_;
                  }
                  else if(param1 == 1)
                  {
                     _loc16_ = _loc15_;
                  }
                  else if(param1 == 2)
                  {
                     _loc16_ = _loc19_;
                  }
                  else
                  {
                     _loc16_ = _loc4_;
                  }
                  _loc5_[_loc6_] = _loc16_[Rndm.integer(0,_loc16_.length - 1)];
               }
               else
               {
                  _loc5_[_loc6_] = "";
                  while(!_loc5_[_loc6_].length > 0)
                  {
                     _loc3_ = MathFunctions.probabilityRandom([0,0.2,0.7,0.995,0.005]);
                     if(_loc2_ > 2)
                     {
                        _loc3_ = Math.ceil(_loc3_ * Rndm.random());
                     }
                     _loc7_ = 0;
                     while(_loc7_ < _loc3_)
                     {
                        do
                        {
                           _loc13_ = MathFunctions.probabilityRandom(_loc14_);
                        }
                        while(!(_loc8_ != "Russian" || !(_loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1) == "ь" && (_loc13_.charAt(0) == "а" || _loc13_.charAt(0) == "о" || _loc13_.charAt(0) == "у" || _loc13_.charAt(0) == "э"))));
                        var _loc22_:* = _loc6_;
                        var _loc23_:* = _loc5_[_loc22_] + _loc13_;
                        _loc5_[_loc22_] = _loc23_;
                        if(_loc7_ != _loc3_ - 1 && _loc8_ == "Greek" && _loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1) == "ς")
                        {
                           _loc5_[_loc6_] = _loc5_[_loc6_].substring(0,_loc5_[_loc6_].length - 1) + "σ";
                        }
                        _loc7_++;
                     }
                     _loc18_ = false;
                     for(_loc7_ in _loc17_)
                     {
                        if(_loc7_ != "" && _loc5_[_loc6_].substr(_loc5_[_loc6_].length - _loc7_.length,_loc7_.length) == _loc7_)
                        {
                           if(param1 != 1)
                           {
                              _loc18_ = true;
                              break;
                           }
                           _loc5_[_loc6_] = _loc5_[_loc6_].substring(0,_loc5_[_loc6_].length - _loc7_.length);
                        }
                     }
                     if(param1 == 2 && !_loc18_)
                     {
                        if(_loc8_ == "Russian")
                        {
                           if(aConsonant(_loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1)) && _loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1) != "ь")
                           {
                              _loc23_ = _loc6_;
                              _loc22_ = _loc5_[_loc23_] + "а";
                              _loc5_[_loc23_] = _loc22_;
                           }
                           else
                           {
                              var _loc25_:* = _loc6_;
                              var _loc24_:* = _loc5_[_loc25_] + "я";
                              _loc5_[_loc25_] = _loc24_;
                           }
                        }
                        else
                        {
                           _loc22_ = _loc6_;
                           _loc23_ = _loc5_[_loc22_] + MathFunctions.probabilityRandom(_loc17_);
                           _loc5_[_loc22_] = _loc23_;
                        }
                     }
                     if(param1 != 2 && _loc8_ == "English" && aConsonant(_loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1)) && !aConsonant(_loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 2)) && Rndm.random() < 0.3)
                     {
                        _loc24_ = _loc6_;
                        _loc25_ = _loc5_[_loc24_] + "e";
                        _loc5_[_loc24_] = _loc25_;
                     }
                     if(param1 == 1 && _loc8_ == "Greek")
                     {
                        _loc23_ = _loc6_;
                        _loc22_ = _loc5_[_loc23_] + MathFunctions.probabilityRandom(_loc12_);
                        _loc5_[_loc23_] = _loc22_;
                     }
                  }
               }
               if(_loc8_ == "Greek" && _loc5_[_loc6_].charAt(_loc5_[_loc6_].length - 1) == "σ")
               {
                  _loc5_[_loc6_] = _loc5_[_loc6_].substring(0,_loc5_[_loc6_].length - 1) + "ς";
               }
               _loc20_ = _loc5_[_loc6_].substring(0,1);
               _loc5_[_loc6_] = _loc20_.toUpperCase() + _loc5_[_loc6_].substring(1,_loc5_[_loc6_].length);
               _loc6_++;
            }
            _loc9_ = _loc5_.join(" ");
         }
         return _loc9_;
      }
      
      private static function aConsonant(param1:*) : *
      {
         var _loc2_:* = undefined;
         for(_loc2_ in vowels)
         {
            if(vowels[_loc2_] == param1)
            {
               return false;
            }
         }
         return true;
      }
   }
}

